---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingLength
source: html/694f7996-4543-ec48-8700-1b3eec2dee42.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingLength { get; }
```